---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GridFailures.GridlineAxisTooFar
source: html/ba6f8ff3-f144-980d-32d6-0eff189098d4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GridFailures.GridlineAxisTooFar Property

Axis of gridlines should not be further than [Value] to each other.

## Syntax (C#)
```csharp
public static FailureDefinitionId GridlineAxisTooFar { get; }
```